{
  "contact_data_map": [
    {
      "full_name": "Kirk Perry",
      "job_title": "Chief Executive Officer"
    },
    {
      "full_name": "Carlos De Jesus",
      "job_title": "Group President, North America"
    },
    {
      "full_name": "Jonathan Halvorson",
      "job_title": "Chief Digital & Marketing Officer"
    }
  ],
  "account_data_map": {
    "strategic_priority_summary": "The company is focused on executing against its four operating priorities: leadership and capabilities, operating strategy, operating model & structure, and execution. The company has identified areas for improvement to win with consumers and operate with greater impact and agility.",
    "risk_summary": "• inflation and other economic factors\n• interest rate and currency exchange rate fluctuations\n• tariffs and other constraints on trade\n• reduced market growth rates\n• competition, including technological advances and new products\n• challenges inherent in new product research and development\n• uncertainty of commercial success for new and existing products",
    "retail_media_intent_flag": false,
    "supply_chain_issues_flag": true,
    "category_focus_flag": true,
    "focussed_category": [
      "Baby Care"
    ]
  },
  "_metadata": {
    "extraction_timestamp": "2025-12-04T14:40:03.670502",
    "company": "kenvue",
    "quarter": "Q3",
    "year": "2025",
    "chunks_used": 20
  },
  "delta_analysis": {
    "Identify Pivots:": "The company has shifted its focus in several areas: from specific competitive pressures to broader competition concerns, from supply chain disruptions to general economic factors, and towards strengthening leadership and capabilities. There's an increased emphasis on inflation and other economic factors.",
    "Tone Shift:": "The tone regarding supply chain seems less concerning in Q3 2025, as it's no longer explicitly mentioned. The tone remains cautious regarding economic pressures and inflation.",
    "Strategy Change:": "There's a shift from focusing on driving efficiencies and expanding margins to a more holistic approach emphasizing operational priorities and strategic growth. The emphasis on winning with consumers suggests a continued consumer-centric strategy, potentially encompassing both DTC and retail partnerships.",
    "comparison_periods": {
      "current": "Q3 2025",
      "previous_quarter": "Q2 2025",
      "same_quarter_last_year": "Q3 2024"
    },
    "data_availability": {
      "current": true,
      "previous_quarter": true,
      "same_quarter_last_year": false
    },
    "analysis_timestamp": "2025-12-05T17:42:45.574685"
  }
}